tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6410_tdd.h
#define TXBNIF                        522
#define RC2IF                         523
#define IPR3                          524
#define CCP3IP                        525
#define TXBNIP                        526
#define TX2IP                         527
#define RC2IP                         528
#define RCSTA1                        529
#define RCSTA1_RX9D                   530
#define RX9D1                         531
#define RCSTA1_RCD8                   532
#define RCSTA1_OERR                   533
#define OERR1                         534
#define RCSTA1_FERR                   535
#define FERR1                         536
#define RCSTA1_ADDEN                  537
#define RCSTA1_ADEN                   538
#define ADDEN1                        539
#define RCSTA1_CREN                   540
#define CREN1                         541
#define SRENA                         542
#define SREN1                         543
#define RCSTA1_SREN                   544
#define RCSTA1_RC9                    545
#define RCSTA1_RC8_9                  546
#define RCSTA1_RX9                    547
#define RX91                          548
#define RCSTA1_SPEN                   549
#define SPEN1                         550
#define TXSTA1                        551
#define TX9D1                         552
#define TXSTA1_TX9D                   553
#define TXSTA1_TXD8                   554
#define TRMT1                         555
#define TXSTA1_TRMT                   556
#define BRGH1                         557
#define TXSTA1_BRGH                   558
#define SENDB1                        559
#define SENDB                         560
#define TXSTA1_SYNC                   561
#define SYNC1                         562
#define TXEN1                         563
#define TXSTA1_TXEN                   564
#define TX91                          565
#define TXSTA1_TX8_9                  566
#define TXSTA1_TX9                    567
#define TXSTA1_CSRC                   568
#define CSRC1                         569
#define PSPCON                        570
#define PSPMODE                       571
#define IBOV                          572
#define OBF                           573
#define IBF                           574
#define T3CON                         575
#define TMR3ON                        576
#define TMR3CS                        577
#define nT3SYNC                       578
#define NOT_T3SYNC                    579
#define T3SYNC                        580
#define T3INSYNC                      581
#define SOSCEN3                       582
#define T3CCP1                        583
#define T3CKPS                        584
#define T3CKPS0                       585
#define T3CKPS1                       586
#define T3CCP2                        587
#define T3CON_RD16                    588
#define RD163                         589
#define T3RD16                        590
#define CMCON                         591
#define CM                            592
#define CMEN0                         593
#define CM0                           594
#define CMEN1                         595
#define CM1                           596
#define CMEN2                         597
#define CM2                           598
#define CIS                           599
#define C1INV                         600
#define C2INV                         601
#define C1OUT                         602
#define C2OUT                         603
#define CVRCON                        604
#define CVR                           605
#define CVR0                          606
#define CVR1                          607
#define CVR2                          608
#define CVR3                          609
#define CVRSS                         610
#define CVREF                         611
#define CVRR                          612
#define CVROEN                        613
#define CVROE                         614
#define CVREN                         615
#define CCP3CON                       616
#define CCP3M                         617
#define CCP3M0                        618
#define CCP3M1                        619
#define CCP3M2                        620
#define CCP3M3                        621
#define DCCP3Y                        622
#define DC3B                          623
#define DC3B0                         624
#define DCCP3X                        625
#define DC3B1                         626
#define CCP2CON                       627
#define CCP2M                         628
#define CCP2M0                        629
#define CCP2M1                        630
#define CCP2M2                        631
#define CCP2M3                        632
#define DC2B0                         633
#define DCCP2Y                        634
#define CCP2Y                         635
#define DC2B                          636
#define DC2B1                         637
#define DCCP2X                        638
#define CCP2X                         639
#define CCP1CON                       640
#define CCP1M0                        641
#define CCP1M                         642
#define CCP1M1                        643
#define CCP1M2                        644
#define CCP1M3                        645
#define DCCP1Y                        646
#define CCP1Y                         647
#define DC1B                          648
#define DC1B0                         649
#define CCP1X                         650
#define DCCP1X                        651
#define DC1B1                         652
#define ADCON2                        653
#define ADCS0                         654
#define ADCS                          655
#define ADCS1                         656
#define ADCS2                         657
#define ACQT0                         658
#define ACQT                          659
#define ACQT1                         660
#define ACQT2                         661
#define ADFM                          662
#define ADCON1                        663
#define PCFG0                         664
#define PCFG                          665
#define PCFG1                         666
#define PCFG2                         667
#define CHSN3                         668
#define PCFG3                         669
#define VCFG                          670
#define VCFG0                         671
#define VCFG01                        672
#define VCFG11                        673
#define VCFG1                         674
#define ADCON0                        675
#define ADON                          676
#define nDONE                         677
#define GO_nDONE                      678
#define NOT_DONE                      679
#define GODONE                        680
#define GO_DONE                       681
#define DONE                          682
#define GO_NOT_DONE                   683
#define GO                            684
#define CHS0                          685
#define CHS                           686
#define CHS1                          687
#define CHS2                          688
#define CHS3                          689
#define SSPCON2                       690
#define SEN                           691
#define RSEN                          692
#define PEN                           693
#define RCEN                          694
#define ACKEN                         695
#define ACKDT                         696
#define ACKSTAT                       697
#define GCEN                          698
#define SSPCON1                       699
#define SSPM0                         700
#define SSPM                          701
#define SSPM1                         702
#define SSPM2                         703
#define SSPM3                         704
#define CKP                           705
#define SSPEN                         706
#define SSPOV                         707
#define WCOL                          708
#define SSPSTAT                       709
#define BF                            710
#define UA                            711
#define R_NOT_W                       712
#define READ_WRITE                    713
#define NOT_W                         714
#define R_W                           715
#define nW                            716
#define RW                            717
#define nWRITE                        718
#define R                             719
#define NOT_WRITE                     720
#define R_nW                          721
#define I2C_READ                      722
#define START                         723
#define S                             724
#define I2C_START                     725
#define STOP                          726
#define I2C_STOP                      727
#define P                             728
#define NOT_A                         729
#define DATA_ADDRESS                  730
#define nA                            731
#define D_A                           732
#define D_nA                          733
#define D                             734
#define DA                            735
#define D_NOT_A                       736
#define NOT_ADDRESS                   737
#define nADDRESS                      738
#define I2C_DAT                       739
#define CKE                           740
#define SMP                           741
#define T2CON                         742
#define T2CKPS0                       743
#define T2CKPS                        744
#define T2CKPS1                       745
#define TMR2ON                        746
#define T2OUTPS0                      747
#define TOUTPS                        748
#define T2OUTPS1                      749
#define T2OUTPS2                      750
#define T2OUTPS3                      751
#define PR2                           752
#define WM0                           753
#define WM1                           754
#define WAIT0                         755
#define WAIT1                         756
#define EBDIS                         757
#define T1CON                         758
#define TMR1ON                        759
#define TMR1CS                        760
#define NOT_T1SYNC                    761
#define T1SYNC                        762
#define nT1SYNC                       763
#define T1INSYNC                      764
#define T1OSCEN                       765
#define SOSCEN                        766
#define T1CKPS0                       767
#define T1CKPS                        768
#define T1CKPS1                       769
#define T1RUN                         770
#define T1RD16                        771
#define T1CON_RD16                    772
#define RCON                          773
#define BOR                           774
#define NOT_BOR                       775
#define nBOR                          776
#define POR                           777
#define nPOR                          778
#define NOT_POR                       779
#define PD                            780
#define nPD                           781
#define NOT_PD                        782
#define NOT_TO                        783
#define nTO                           784
#define TO                            785
#define nRI                           786
#define NOT_RI                        787
#define RI                            788
#define SBOREN                        789
#define IPEN                          790
#define WDTCON                        791
#define SWDTE                         792
#define SWDTEN                        793
#define HLVDCON                       794
#define HLVDL                         795
#define HLVDL0                        796
#define LVV0                          797
#define LVDL0                         798
#define HLVDL1                        799
#define LVV1                          800
#define LVDL1                         801
#define HLVDL2                        802
#define LVV2                          803
#define LVDL2                         804
#define HLVDL3                        805
#define LVV3                          806
#define LVDL3                         807
#define HLVDEN                        808
#define LVDEN                         809
#define BGST                          810
#define IRVST                         811
#define VDIRMAG                       812
#define OSCCON                        813
#define SCS0                          814
#define SCS                           815
#define SCS1                          816
#define FLTS                          817
#define IOFS                          818
#define OSTS                          819
#define IRCF                          820
#define IRCF0                         821
#define IRCF1                         822
#define IRCF2                         823
#define IDLEN                         824
#define T0CON                         825
#define T0PS                          826
#define T0PS0                         827
#define T0PS1                         828
#define T0PS2                         829
#define PSA                           830
#define T0SE                          831
#define T0CS                          832
#define T08BIT                        833
#define TMR0ON                        834
#define STATUS                        835
#define C                             836
#define CARRY                         837
#define DC                            838
#define ZERO                          839
#define Z                             840
#define OV                            841
#define OVERFLOW                      842
#define N                             843
#define NEGATIVE                      844
#define INTCON3                       845
#define INT1IF                        846
#define INT1F                         847
#define INT2IF                        848
#define INT2F                         849
#define INT3F                         850
#define INT3IF                        851
#define INT1E                         852
#define INT1IE                        853
#define INT2IE                        854
#define INT2E                         855
#define INT3E                         856
#define INT3IE                        857
#define INT1P                         858
#define INT1IP                        859
#define INT2IP                        860
#define INT2P                         861
#define INTCON2                       862
#define RBIP                          863
#define INT3IP                        864
#define INT3P                         865
#define TMR0IP                        866
#define T0IP                          867
#define INTEDG3                       868
#define INTEDG2                       869
#define INTEDG1                       870
#define INTEDG0                       871
#define RBPU                          872
#define NOT_RBPU                      873
#define nRBPU                         874
#define INTCON                        875
#define RBIF                          876
#define INT0F                         877
#define INT0IF                        878
#define T0IF                          879
#define TMR0IF                        880
#define RBIE                          881
#define INT0E                         882
#define INT0IE                        883
#define T0IE                          884
#define TMR0IE                        885
#define PEIE                          886
#define PEIE_GIEL                     887
#define GIEL                          888
#define GIE_GIEH                      889
#define GIE                           890
#define GIEH                          891
#define STKPTR0                       892
#define STKPTR                        893
#define STKPTR1                       894
#define STKPTR2                       895
#define STKPTR3                       896
#define STKPTR4                       897
#define STKUNF                        898
#define STKOVF                        899
#define STKFUL                        900

#endif // _PIC18LF6410_H_
